# Brewfile - Homebrew packages for developer setup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Essential CLI tools
brew "git"
brew "git-lfs"
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"  # Modern replacement for ls
brew "zoxide"  # Smarter cd command
brew "gh"  # GitHub CLI
brew "tldr"  # Simplified man pages

# Development tools
brew "neovim"
brew "node"
brew "python3"
brew "go"
brew "rust"

# Python package manager (uv)
brew "uv"

# Database tools
brew "postgresql@16"
brew "redis"

# Container & orchestration
brew "docker"
brew "docker-compose"

# Cloud CLIs
brew "awscli"

# Content creation & developer advocate tools
brew "asciinema"  # Terminal session recording
brew "glow"  # Markdown renderer for terminal

# Fonts (for terminal)
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# Applications
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "postman"
cask "rectangle"  # Window management
cask "raycast"  # Spotlight replacement

# Developer advocate tools
cask "loom"  # Quick video recording and sharing
cask "cleanshot"  # Advanced screenshot and recording
cask "figma"  # UI/UX design and prototyping
cask "insomnia"  # API testing and development
cask "canva"  # Graphics and social media content
cask "1password"  # Password management
cask "elgato-stream-deck"  # Stream control
cask "discord"  # Community management
